{
    "posts": [
        " What is machine learning? Machine learning is a subset of artificial intelligence (AI) that enables computers to learn from experience and improve over time. It is used to develop predictive models that can be used to make decisions or predictions about future events. Machine learning is a field of computer science that gives computers the ability to learn without being explicitly programmed. Machine learning is employed in a variety of applications, including email spam filtering, optical character recognition, and medical diagnosis. Machine learning is a process where computers use data to learn how to do things on their own. This can include recognizing objects in images, understanding natural language, or predicting outcomes. What types of machine learning are there? Machine learning can be broadly classified into four types: Supervised Learning: In this type of machine learning, the model is trained on a labeled dataset. That is, the correct answer (label) is provided with the data. The model learns from this data and applies the learned knowledge to new data. Examples of supervised learning algorithms include linear regression, decision trees, k-nearest neighbors, and support vector machines. Unsupervised Learning: Unlike supervised learning, in unsupervised learning, the model is not provided with the correct answers. The model must find structure in its input on its own. It s often used for clustering, dimensionality reduction, and anomaly detection. Examples of unsupervised learning algorithms include k-means clustering, hierarchical clustering, and principal component analysis. Semi-Supervised Learning: This type of machine learning lies between supervised and unsupervised learning. In semi-supervised learning, the model is trained on a combination of labeled and unlabeled data. This method is useful when the cost of labeling data is too high. Reinforcement Learning: In reinforcement learning, an agent learns how to behave in an environment by performing actions and receiving rewards or penalties. The agent learns a policy, which is a mapping from states to actions. The goal of the agent is to learn a policy that maximizes the sum of rewards over time. Examples of reinforcement learning algorithms include Q-learning and Deep Q Networks (DQN). There are also other types of machine learning based on the nature of the learning  signal  or  feedback  available to a learning system: Active Learning: The model can only obtain the labels for a limited set of instances based on its own queries. The model decides which instances to acquire labels for. Transfer Learning: The model is trained on one task and applied to another related task. Multi-instance Learning: The model is provided with bags of instances, and a label for the entire bag. The task is to predict the label of unseen bags based on the instances they contain. Multi-task Learning: The model is trained on multiple related tasks simultaneously, with the aim of improving generalization by leveraging the commonalities and differences across tasks. Each of these types of machine learning has its own strengths and weaknesses, and the choice of which to use depends on the nature of the problem to be solved. Interest in machine learning over time It is very clear that interest levels in machine learning have been growing very strongly since 2014. It is to be expected that this growth trend will continue in the foreseeable future. ",
        " In 2019, we conducted our first global survey on how newsrooms are using AI in their work. At the time, even some early adopters were at the beginning of the AI integration process. Since then, so much has changed in the world of AI and in the ways media makers approach and use these technologies. In our latest research report, Generating Change, we share what newsrooms are doing with AI today. We wanted to reach a larger and more diverse group of media professionals this year. Between April and July 2023, we surveyed 105 news organizations from 46 countries about their engagement with AI and associated technologies. JournalismAI is a global initiative of Polis, the journalism think tank at the London School of Economics and Political Science (LSE), and is supported by the Google News Initiative. The latest report is meant to serve as a comparative exercise to help us better understand some of the trends we re seeing around AI in the newsroom. Now, let s get into the findings: Almost three quarters (73%) of news organizations surveyed believe generative AI applications, such as Bard or ChatGPT, present new opportunities for journalism. Around 85% of survey respondents   including journalists, technologists and managers at news organizations   have at the very least experimented with generative AI to help with tasks such as writing code, image generation and authoring summaries. Some respondents noted AI can help free up capacity for more creative work by helping with time-intensive tasks such as interview transcription and fact-checking. Respondents pointed out that generative AI is accessible, has low requirements for technical skills, and what was described as their ability to understand  context. This, they say, makes generative AI stand out from other AI technologies that generally require deep specialist expertise in areas like programming. Despite these opportunities, respondents recognized the need for any AI-generated content to be checked by a human to mitigate potential harms like bias and inaccuracy. More than 60% of respondents noted their concern about the ethical implications of AI on journalistic values including accuracy, fairness and transparency and other aspects of journalism. While newsrooms globally contend with challenges related to AI integration, the challenges are more pronounced for newsrooms in the Global South (e.g., Brazil, Russia, India, China and South Africa). Respondents highlighted language, infrastructure and political challenges. They noted how the social and economic benefits of AI tend to be geographically concentrated in northern nations, where there is better infrastructure and easier access to resources. With 80% of respondents expecting an increased use of AI in their newsrooms, the report s authors believe this is a crucial opportunity for who they call  good  journalists to do more  human  work with the support of AI. With these results, we have new questions about the future of journalism AI. For instance, will relying on generative AI technologies in editorial tasks become an industry norm? Or could it become a widely unacceptable practice? You can download the full report on JournalismAI s website. ",
        " Today, many seasoned security professionals will tell you they ve been fighting a constant battle against cybercriminals and state-sponsored attackers. They will also tell you that any clear-eyed assessment shows that most of the patches, preventative measures and public awareness campaigns can only succeed at mitigating yesterday s threats   not the threats waiting in the wings. That could be changing. As the world focuses on the potential of AI   and governments and industry work on a regulatory approach to ensure AI is safe and secure  we believe that AI represents an inflection point for digital security. We re not alone. More than 40% of people view better security as a top application for AI   and it s a topic that will be front and center at the Munich Security Conference this weekend. AI is at a definitive crossroads   one where policymakers, security professionals and civil society have the chance to finally tilt the cybersecurity balance from attackers to cyber defenders. At a moment when malicious actors are experimenting with AI, we need bold and timely action to shape the direction of this technology. To support this work, today we re launching a new AI Cyber Defense Initiative, including a proposed policy and technology agenda contained in our new report: Secure, Empower, Advance: How AI Can Reverse the Defender s Dilemma. How to tilt the cybersecurity balance from attackers to defenders Today, and for decades, the main challenge in cybersecurity has been that attackers need just one successful, novel threat to break through the best defenses. Defenders, meanwhile, need to deploy the best defenses at all times, across increasingly complex digital terrain   and there s no margin for error. This is the  Defender s Dilemma,  and there s never been a reliable way to tip that balance. Our experience deploying AI at scale informs our belief that AI can actually reverse this dynamic. AI allows security professionals and defenders to scale their work in threat detection, malware analysis, vulnerability detection, vulnerability fixing and incident response. Three ways we re applying AI to security while supporting others Through the AI Cyber Defense Initiative, we re continuing our investment in an AI-ready infrastructure, releasing new tools for defenders, and launching new research and AI security training. These commitments are designed to help AI secure, empower and advance our collective digital future. 1. Secure. We believe AI security technologies, just like other technologies, need to be secure by design and by default   or they could further deepen the Defender s Dilemma. This is why we started the Secure AI Framework as a vehicle to collaborate on best practices for securing AI systems. To build on these efforts to foster a more secure AI ecosystem: We continue to invest in our secure, AI-ready network of global data centers. To help turn the tide in cyberspace, we need to make new AI innovations available to public sector organizations and businesses of all sizes across industries. Over the period 2019 to end 2024, we will have invested over $5 billion in data centers in Europe   helping support secure, reliable access to a range of digital services, including broad generative AI capabilities like our Vertex AI platform. We re announcing a new  AI for Cybersecurity cohort of 17 startups from the UK, US and EU under the Google for Startups Growth Academy s AI for Cybersecurity Program. This will help strengthen the transatlantic cybersecurity ecosystem with internationalization strategies, AI tools, and the skills to use them. 2. Empower. AI governance choices made today can shift the terrain in cyberspace in unintended ways. Our societies need a balanced regulatory approach to AI usage and adoption to avoid a future where attackers can innovate but defenders cannot. We need targeted investments, partnerships between industry and government, and effective regulatory approaches to empower organizations to maximize the value from AI while limiting utility to adversaries. To help give defenders the upper hand in this fight: We re expanding our $15 million Google.org Cybersecurity Seminars Program to cover all of Europe, initially announced at GSEC Malaga last year. The program, which includes AI-focused modules, supports universities to train the next generation of cybersecurity experts from underserved communities. We re open-sourcing Magika, a new, AI-powered tool to aid defenders through file type identification, an essential part of detecting malware. Magika is already used to help protect products including Gmail, Drive and Safe Browsing, as well as by our VirusTotal team to foster a safer digital environment. Magika outperforms conventional file identification methods providing an overall 30% accuracy boost and up to 95% higher precision on traditionally hard to identify, but potentially problematic content such as VBA, JavaScript and Powershell. 3. Advance. We re committed to advancing research that helps generate breakthroughs in AI-powered security. To support this effort, we re announcing $2 million in research grants and strategic partnerships that will help strengthen cybersecurity research initiatives using AI, including enhancing code verification, improving understanding of how AI can help with cyber offense and countermeasures for defense, and developing large language models that are more resilient to threats. The funding is supporting researchers at institutions including The University of Chicago, Carnegie Mellon and Stanford. This builds on our ongoing efforts to stimulate the cybersecurity ecosystem, including our $12 million commitment to the New York research system last year. The AI revolution is already underway. While people rightly applaud the promise of new medicines and scientific breakthroughs, we re also excited about AI s potential to solve generational security challenges while bringing us close to the safe, secure and trusted digital world we deserve. "
    ],
    "pages": [
        " Conversational AI vs. Chatbots Conversational AI and chatbots are often discussed together, so knowing how they relate is important. Chatbots are an application of conversational AI, but not all chatbots use conversational AI. Most chatbots are rule-based, where they re preprogrammed with specific canned responses and scripts and can t handle more complex conversations. AI chatbots can handle multiple types of conversations and topics and use data to give the most accurate response. How does conversational AI work? Conversational AI exists through machine learning, natural language processing (NLP), and natural language generation (NLG). Machine learning is how a conversational AI tool gets its intelligence. It begins with human input, where someone feeds a machine a unique data set to learn from. It studies the data, understands connections, and eventually becomes ready to have real conversations with real humans. Natural language processing is the machine s ability to recognize words and phrases from conversations with humans because of the original data it learned from. The tool then uses NLG to develop the best possible responses to human queries. Conversational AI only gets better and more accurate over time as it continuously learns from every conversation. The overall process is this: Input is received as text or audio (spoken words or general sounds). The machine analyzes the input with natural language processing to uncover what the input means and what a response could include. Once the input is understood, conversational AI brings a user the best and most accurate information (NLG). Machines use data from every conversation to build knowledge and generate more accurate responses. Examples of Conversational AI A common marketing application of conversational AI is content generation tools that research topics online and create content outputs like blog posts, emails, and even ad copy. HubSpot s content assistant is a great example of a tool that uses generative AI to help marketers create written content. You can simply tell HubSpot what you d like to write about, and the content assistant can do things like: Generate a list of blog topics your audience cares about Create an outline to kickstart your writing process Write crisp and compelling copy optimized for your readers and search engines. The AI content assistant natively integrates with your favorite HubSpot features. Another application is text to speech tools that convert text to natural-sounding speech, improving accessibility for people using assistive technologies. You can also use speech-to-text software to understand your customers better. Social listening and monitoring tools also use NLP to understand the tone and intent of online conversations to understand how people feel about your brand. HR and recruiting tools also scan through resumes and cover letters for keywords and phrases to identify ideal candidates for job postings. Other applications are smart home devices, like Google Home, and virtual assistants like Apple s Siri. To stay on the cutting edge of a growing market, check out HubSpot s playlist, The Business of AI, which features shows that discuss future business applications of AI. Benefits of Conversational AI With these examples in mind, what benefits can conversational AI bring to a business? 1. Conversational AI can save time. Conversational AI can take charge of conversations with consumers and bring relevant results, helping teams focus on more pressing issues that require a human touch. Conversational AI can also process large amounts of data points and bring insights and answers to business teams quickly, helping make data-driven decisions and freeing up the burden of data processing. 2. Conversational AI gives data-driven insights The data that conversational AI tools collect can be helpful resources for businesses to learn about consumers and what they want, whether it s commonly asked questions that can be used to update a FAQ page or to learn more about how people talk about you online. 3. Conversational AI can drive purchases. Conversational AI tools can use NLP to understand customer queries, learn needs and pain points, and generate product or service recommendations that inspire purchases. 4. Conversational AI can find best-fit customers. Conversational AI can sort through many data points to help you find ideal customers. 5. Conversational AI can conduct brand monitoring. As mentioned above, conversational AI can analyze what people say about your business online and scan for common phrases and keywords to understand brand sentiment. This is a significant time saver, as marketers can spend less time sorting through hundreds of conversations and interactions. This is where there are drawbacks to conversational AI, as nothing can mimic the importance of human understanding. Challenges of Conversational AI Conversational AI is an exciting front for marketers, but it s always important to understand the entire picture, as there are two sides to every coin. The most significant way brands can go wrong with adopting conversational AI is if it takes over functions that can still benefit from human monitoring and interaction. For example, a tool can monitor online conversations, but a human can pick up on subtleties that a machine can t. An HR tool can sift through job applications for specific keywords and phrases to find best-fit candidates, but a human reviewer can tell when a candidate has the commensurate experience that makes them a great fit, even if their resume doesn t contain target keywords. Some additional challenges of conversational AI include: Language Input: Dialects, slang, and even background noise can impact a machine s ability to process language input. Privacy: Conversational tools store and collect data to improve its processes, but security or data breaches can cause safety concerns if consumers  personal information is exposed. Human and Cultural Development: Machine learning must continuously progress to learn alongside human cultural development, whether general cultural knowledge or something more specific like showtimes for a newly released movie. "
    ]
}